import { IMeta } from '../components/core/Meta';
import Page from '../components/shared/Page';

const aboutMeta: IMeta = {
	title: 'من هو هادي 😁',
	description: 'حقائق ومعلومات عامة عن هادي البن سعد.'
};
export default function About() {
	return (
		<Page meta={aboutMeta} title="هادي البن سعد 🤾🏻‍♂️">

			والله شف
			<br/><br/><br/>
			يقولون لا تعيد اختراع العجلة! طيب يمكن تنتبه لشيء ما انتبه له اللي قبلك.


			<br/><br/><br/>

			تقني 📈
			<br/><br/>
			مسلم
			<br/><br/>
			ما أحب أقرأ كتب
			<br/><br/>
			أحب اجلس مع ناس تسولف وتفكر
			<br/><br/>
			أحب اعلم الناس وأدربهم
			<br/><br/>
			أحب اسوي مشاريع واخليها فنانة
			<br/><br/>
			قبل شهر كنت اشرب قهوة كل يوم، والحين لي اسبوع ما شربت، مدري بعد كم يوم بقولك إذا احب القهوة او لا
			<br/><br/>
			عندي نظريات كثيرة موثقة من معهد هادي للعلوم الحياتية والتقنية المتقدمة
			<br/><br/>
			احب اخلي الكمبيوتر يسوي كل شيء يقدر يسويه
			<br/><br/>
			ما احب الكمبيوترات، بس اعرف لها واخليها تخدم الناس
			<br/> <br/>
			مرة كويس في انقيولر
			<br/><br/><br/>
			والله كل الفريموركس سهلة
			<br/><br/>
			اشتغل انقيولر وفلتر ورياكت وسوفت ونود باك اند ومونقو غالبا للداتا بيز (لعبتي الsql بعد)
			و اعرف اسوي سيرفرات واضبطها ع الخفيف بس الكلاود احسن واريح
		</Page>
	);
}
